# PYTHON FOR DATA ANALYSIS IBM

In [26]:
!pip install pandas
import pandas as pd
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df=pd.DataFrame(x)

#display the result df
df

[notice] A new release of pip available: 22.3.1 -> 23.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python311\lib\site-packages (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dell\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dell\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [25]:
 raw_data={'Name':['Ryan','Henry','Martial'],'ID':['1','2','3']}
raw_data2={'Name':['RIN','Fern','Mady'],'ID':['4','5','6']}

In [5]:
raw_data

{'Name': ['Ryan', 'Henry', 'Martial'], 'ID': ['1', '2', '3']}

In [6]:
df=pd.DataFrame(raw_data)

In [7]:
df2 =pd.DataFrame(raw_data2)

In [8]:
df2

   Name ID
0   RIN  4
1  Fern  5
2  Mady  6

# PROJECT OVERVIEW
-Make 2 dataframes of 6 clients with name and id.
-Let's assume we got their annual salary about all our clients(all 6)
-Concatenate two dataframes and merge their names and salary using client ID.
-Let's assume you became new client to the bank.
-define your name salary and client id (7) and add it to the combined data frame bankall_df.

In [9]:
raw_data={'Annual Salary':['2500','1000','20000','100','15000','5000'],'ID':['1','2','3','4','5','6']}

In [10]:
banksalary_df=pd.DataFrame(raw_data)

In [11]:
banksalary_df

  Annual Salary ID
0          2500  1
1          1000  2
2         20000  3
3           100  4
4         15000  5
5          5000  6

In [12]:
bankall_df=pd.concat([df,df2])

In [13]:
bankall_df

      Name ID
0     Ryan  1
1    Henry  2
2  Martial  3
0      RIN  4
1     Fern  5
2     Mady  6

In [14]:
bankall_df=pd.merge(bankall_df,banksalary_df, on='ID')

In [15]:
bankall_df

      Name ID Annual Salary
0     Ryan  1          2500
1    Henry  2          1000
2  Martial  3         20000
3      RIN  4           100
4     Fern  5         15000
5     Mady  6          5000

In [17]:
newclient={'Name':['Drishya'],'Annual Salary':['90000'],'ID':['7']}

In [18]:
newclient_df=pd.DataFrame(newclient)

In [21]:
bankall_df=pd.concat([bankall_df,newclient_df])

In [27]:
bankall_df

      Name ID Annual Salary
0     Ryan  1          2500
1    Henry  2          1000
2  Martial  3         20000
3      RIN  4           100
4     Fern  5         15000
5     Mady  6          5000
0  Drishya  7         90000